In [1]:
# https://pandas.pydata.org/pandas-docs/stable/reference/frame.html#dataframe

import pandas as pd
import numpy as np

In [2]:
d1 = [[1,2],[3,4],[5,6]]
d2 = [(1,2),(3,4),(5,6)]
d3 = [{'kor':1, 'eng':2},
      {'kor':3, 'eng':4},
      {'kor':5, 'eng':6}]
d4 ={'kor':[1,3,5],'eng':[2,4,6]}

In [12]:
df1 = pd.DataFrame(d1,index=['a','b','c'], columns=['kor','eng'])
df1

   kor  eng
a    1    2
b    3    4
c    5    6

In [6]:
df2 = pd.DataFrame(d2)
df2

   0  1
0  1  2
1  3  4
2  5  6

In [8]:
df3 = pd.DataFrame(d3)
df3

   kor  eng
0    1    2
1    3    4
2    5    6

In [9]:
df4 = pd.DataFrame(d4)
df4

   kor  eng
0    1    2
1    3    4
2    5    6

In [65]:
data =  {'eng':[10,30,50,70],
         'kor':[20,40,60,80],
         'math':[90,50,20,70]}
df = pd.DataFrame(data,index=['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [15]:
df.ndim # dimension

2

In [17]:
df.shape # (row number, column number)

(4, 3)

In [19]:
df.size # row number * column number

12

In [21]:
len(df) # row number / en is the abbreviation of length.

4

In [22]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [23]:
df.columns

Index(['eng', 'kor', 'math'], dtype='object')

In [25]:
df.values

array([[10, 20, 90],
       [30, 40, 50],
       [50, 60, 20],
       [70, 80, 70]])

In [26]:
df .dtypes

eng     int64
kor     int64
math    int64
dtype: object

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eng     4 non-null      int64
 1   kor     4 non-null      int64
 2   math    4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [29]:
df.T

       a   b   c   d
eng   10  30  50  70
kor   20  40  60  80
math  90  50  20  70

In [36]:
df[['eng','math']]

   eng  math
a   10    90
b   30    50
c   50    20
d   70    70

In [37]:
df[0:2]

   eng  kor  math
a   10   20    90
b   30   40    50

In [45]:
df.iloc[0:2,0:2]

   eng  kor
a   10   20
b   30   40

In [49]:
df.iloc[[0,2],[0,2]]

   eng  math
a   10    90
c   50    20

In [56]:
df.loc[['a','c'],'eng']

a    10
c    50
Name: eng, dtype: int64

In [57]:
df.loc['b':,'kor':]

   kor  math
b   40    50
c   60    20
d   80    70

In [59]:
df + 2

   eng  kor  math
a   12   22    92
b   32   42    52
c   52   62    22
d   72   82    72

In [64]:
df.loc['c':,'kor':] = [[1,2],[3,4]]

   eng  kor  math
a   10   20    90
b   30   40    50
c   50    1     2
d   70    3     4

In [72]:
(df > 30).sum()

eng     2
kor     3
math    3
dtype: int64

In [75]:
df.query('eng > 20 and kor >50')

   eng  kor  math
c   50   60    20
d   70   80    70